driver-tests/httpsoapbc/HttpSoapBCTests/HttpSoapBCJbi/test/MultiOp_UserTestCase2_startProcess/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:type="http://www.ardatis.com/ventouris/SeeBeyondService/type">
  <soapenv:Body>
    <type:SetStartProcessRequest>
      <dossierId>MyDossierIDX</dossierId>
      <affiliateId>Affiliate10</affiliateId>
    </type:SetStartProcessRequest>
  </soapenv:Body>
</soapenv:Envelope>